-----------------------------------------------------------------------------------------------------------
      name:  jemlog
       log:  /Users/billy/Desktop/Articles/JEM/src/logs/JEMlogs.txt
  log type:  text
 opened on:  30 Nov 2017, 06:04:50

. 
. import excel using ../JEMSTUDY2.xlsx, clear first case(l)

. 
. qui: replace porf = cond(porf == "P", "1", cond(porf == "F", "0", ""))

. rename (inst1 studno studscor porf itemno itemjud)(inst1 stdid score pred        ///   
> itemid itemdiff)

. qui: destring pred, replace

. la def passfail 0 "Fail" 1 "Pass", modify

. la val pred passfail

. qui: g byte tchid = cond(inst1 == "A", 1, cond(inst1 == "B", 2, 3))

. drop inst1

. mata:
------------------------------------------------- mata (type end to exit) ---------------------------------
:         angoff = select(st_data(., (4..6)), rowmissing(st_data(., (4..6))) :== 0)

:         cutscores = J(1, 4, .)

:         for( i = 1; i <= 3; i++) {
>                 cutscores[1, i] = colsum(select(angoff[., 2], angoff[., 3] :== i))
>         }

:         cutscores[1, 4] = rowsum(cutscores[1, 1..3]) / 3

:         st_matrix("cutscores", cutscores)

: end
-----------------------------------------------------------------------------------------------------------

. 
. drop itemid itemdiff

. forv i = 1/3 {
  2.         g tch`i'cutscore = cutscores[1, `i']
  3.         g tch`i'pf = score >= tch`i'cutscore
  4.         g tch`i'dist = score - tch`i'cutscore
  5. }
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)

. g angoff = cutscores[1, 4]

. g byte angoffpf = score >= angoff

. g byte angoffdist = score - angoff
(5 missing values generated)

. foreach v of var *pf {
  2.         la val `v' passfail
  3. }

. drop if mi(stdid)
(5 observations deleted)

. la var stdid "Student ID #"

. la var tchid "Instructor ID #"

. la var score "Observed Test Score"

. la var pred "Contrasting Groups Based Prediction"

. la var tch1cutscore "Sum of Instructor 1 Item Difficulties"

. la var tch2cutscore "Sum of Instructor 2 Item Difficulties"

. la var tch3cutscore "Sum of Instructor 3 Item Difficulties"

. la var angoff "Cutscore Derived through Angoff Method"

. 
. la var tch1pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var tch2pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var tch3pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var angoffpf "Pass/Fail Indicator Derived using Angoff Threshold"

. 
. la var tch1dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var tch2dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var tch3dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var angoffdist "Difference of Observed Student Score and Angoff Threshold"

. 
. #d ;
delimiter now ;
. tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if pred == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if pred == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Contrasting Groups Based Cutscores", c(black) size(medlarge) span)
>         name(contrastingGroup, replace);

.         tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if angoffpf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if angoffpf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Angoff Method Based Cutscores", c(black) size(medlarge) span)
>         name(angoff, replace);

. tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch1pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch1pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 1 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch1, replace);

. tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch2pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch2pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 2 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch2, replace);

. tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch3pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch3pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 3 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch3, replace);

.         gr combine contrastingGroup angoff, name(methodcombo, replace) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) ;

. gr combine tch1 tch2 tch3, name(tchcombo, replace)
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) ;

. #d cr   
delimiter now cr
. 
. foreach v in contrastingGroup angoff tch1 tch2 tch3 methodcombo tchcombo {
  2.         qui: gr export graphs/`v'.pdf, as(pdf) name(`v') replace
  3. }

. 
. di _n "Score Summary Statistics"

Score Summary Statistics

. tabstat score, by(tchid) c(s) s(n mean sd min p25 p50 p75 max)

Summary for variables: score
     by categories of: tchid (Instructor ID #)

   tchid |         N      mean        sd       min       p25       p50       p75       max
---------+--------------------------------------------------------------------------------
       1 |        17  5.411765  1.502449         3         4         5         6         8
       2 |        29  6.172414  2.916321         2         4         6         8        13
       3 |         8       5.5  2.390457         3         4         4         8         9
---------+--------------------------------------------------------------------------------
   Total |        54  5.833333  2.462933         2         4         5         8        13
------------------------------------------------------------------------------------------

. 
. di _n "Score Distributions within Instructors by predicted outcome"

Score Distributions within Instructors by predicted outcome

. 
. forv i = 1/3 {
  2.         ta score pred if tchid == `i', exact
  3. }

Enumerating sample-space combinations:
stage 6:  enumerations = 1
stage 5:  enumerations = 2
stage 4:  enumerations = 3
stage 3:  enumerations = 5
stage 2:  enumerations = 8
stage 1:  enumerations = 0

           |  Contrasting Groups
  Observed |   Based Prediction
Test Score |      Fail       Pass |     Total
-----------+----------------------+----------
         3 |         1          0 |         1 
         4 |         3          2 |         5 
         5 |         3          0 |         3 
         6 |         3          1 |         4 
         7 |         0          2 |         2 
         8 |         1          0 |         1 
-----------+----------------------+----------
     Total |        11          5 |        16 

           Fisher's exact =                 0.334

Enumerating sample-space combinations:
stage 10: enumerations = 1
stage 9:  enumerations = 2
stage 8:  enumerations = 3
stage 7:  enumerations = 4
stage 6:  enumerations = 9
stage 5:  enumerations = 13
stage 4:  enumerations = 16
stage 3:  enumerations = 29
stage 2:  enumerations = 34
stage 1:  enumerations = 0

           |  Contrasting Groups
  Observed |   Based Prediction
Test Score |      Fail       Pass |     Total
-----------+----------------------+----------
         2 |         3          1 |         4 
         3 |         0          1 |         1 
         4 |         2          2 |         4 
         5 |         3          2 |         5 
         6 |         1          1 |         2 
         7 |         0          2 |         2 
         8 |         1          5 |         6 
         9 |         0          2 |         2 
        10 |         1          0 |         1 
        13 |         0          1 |         1 
-----------+----------------------+----------
     Total |        11         17 |        28 

           Fisher's exact =                 0.399

Enumerating sample-space combinations:
stage 4:  enumerations = 1
stage 3:  enumerations = 1
stage 2:  enumerations = 1
stage 1:  enumerations = 0

           |  Contrasting Groups
  Observed |   Based Prediction
Test Score |      Fail       Pass |     Total
-----------+----------------------+----------
         3 |         1          0 |         1 
         4 |         0          4 |         4 
         8 |         0          1 |         1 
         9 |         0          1 |         1 
-----------+----------------------+----------
     Total |         1          6 |         7 

           Fisher's exact =                 0.429

. 
. di _n "Score Distributions between Instructors by predicted outcome"

Score Distributions between Instructors by predicted outcome

. ta score pred, exact    

Enumerating sample-space combinations:
stage 10: enumerations = 1
stage 9:  enumerations = 2
stage 8:  enumerations = 3
stage 7:  enumerations = 10
stage 6:  enumerations = 18
stage 5:  enumerations = 60
stage 4:  enumerations = 104
stage 3:  enumerations = 240
stage 2:  enumerations = 488
stage 1:  enumerations = 0

           |  Contrasting Groups
  Observed |   Based Prediction
Test Score |      Fail       Pass |     Total
-----------+----------------------+----------
         2 |         3          1 |         4 
         3 |         2          1 |         3 
         4 |         5          8 |        13 
         5 |         6          2 |         8 
         6 |         4          2 |         6 
         7 |         0          4 |         4 
         8 |         2          6 |         8 
         9 |         0          3 |         3 
        10 |         1          0 |         1 
        13 |         0          1 |         1 
-----------+----------------------+----------
     Total |        23         28 |        51 

           Fisher's exact =                 0.062

. 
. 
. // Here is the non-parametric receiver operating curve estimation
. roctab pred score, detail bamber summ

Detailed report of sensitivity and specificity
------------------------------------------------------------------------------
                                           Correctly
Cutpoint      Sensitivity   Specificity   Classified          LR+          LR-
------------------------------------------------------------------------------
( >= 2 )          100.00%         0.00%       54.90%       1.0000     
( >= 3 )           96.43%        13.04%       58.82%       1.1089       0.2738
( >= 4 )           92.86%        21.74%       60.78%       1.1865       0.3286
( >= 5 )           64.29%        43.48%       54.90%       1.1374       0.8214
( >= 6 )           57.14%        69.57%       62.75%       1.8776       0.6161
( >= 7 )           50.00%        86.96%       66.67%       3.8333       0.5750
( >= 8 )           35.71%        86.96%       58.82%       2.7381       0.7393
( >= 9 )           14.29%        95.65%       50.98%       3.2857       0.8961
( >= 10 )           3.57%        95.65%       45.10%       0.8214       1.0081
( >= 13 )           3.57%       100.00%       47.06%                    0.9643
( >  13 )           0.00%       100.00%       45.10%                    1.0000
------------------------------------------------------------------------------


                      ROC      Bamber        -Asymptotic Normal--
           Obs       Area     Std. Err.      [95% Conf. Interval]
     ------------------------------------------------------------
            51     0.6561       0.0766        0.50591     0.80621

. 
. // Seems like contrasting groups yields the same result overall
. // Perhaps differences between instructors
. 
. forv i = 1/3 {
  2.         di _n(2) "Instructor ID# `i'.  Sum of Predicted Item Difficulties for this instructor = " cuts
> cores[1, `i'] 
  3.         roctab pred score if tchid == `i', detail bamber summ
  4. }


Instructor ID# 1.  Sum of Predicted Item Difficulties for this instructor = 5

Detailed report of sensitivity and specificity
------------------------------------------------------------------------------
                                           Correctly
Cutpoint      Sensitivity   Specificity   Classified          LR+          LR-
------------------------------------------------------------------------------
( >= 3 )          100.00%         0.00%       31.25%       1.0000     
( >= 4 )          100.00%         9.09%       37.50%       1.1000       0.0000
( >= 5 )           60.00%        36.36%       43.75%       0.9429       1.1000
( >= 6 )           60.00%        63.64%       62.50%       1.6500       0.6286
( >= 7 )           40.00%        90.91%       75.00%       4.4000       0.6600
( >= 8 )            0.00%        90.91%       62.50%       0.0000       1.1000
( >  8 )            0.00%       100.00%       68.75%                    1.0000
------------------------------------------------------------------------------


                      ROC      Bamber        -Asymptotic Normal--
           Obs       Area     Std. Err.      [95% Conf. Interval]
     ------------------------------------------------------------
            16     0.6091       0.1734        0.26915     0.94903


Instructor ID# 2.  Sum of Predicted Item Difficulties for this instructor = 6.4

Detailed report of sensitivity and specificity
------------------------------------------------------------------------------
                                           Correctly
Cutpoint      Sensitivity   Specificity   Classified          LR+          LR-
------------------------------------------------------------------------------
( >= 2 )          100.00%         0.00%       60.71%       1.0000     
( >= 3 )           94.12%        27.27%       67.86%       1.2941       0.2157
( >= 4 )           88.24%        27.27%       64.29%       1.2132       0.4314
( >= 5 )           76.47%        45.45%       64.29%       1.4020       0.5176
( >= 6 )           64.71%        72.73%       67.86%       2.3725       0.4853
( >= 7 )           58.82%        81.82%       67.86%       3.2353       0.5033
( >= 8 )           47.06%        81.82%       60.71%       2.5882       0.6471
( >= 9 )           17.65%        90.91%       46.43%       1.9412       0.9059
( >= 10 )           5.88%        90.91%       39.29%       0.6471       1.0353
( >= 13 )           5.88%       100.00%       42.86%                    0.9412
( >  13 )           0.00%       100.00%       39.29%                    1.0000
------------------------------------------------------------------------------


                      ROC      Bamber        -Asymptotic Normal--
           Obs       Area     Std. Err.      [95% Conf. Interval]
     ------------------------------------------------------------
            28     0.6979       0.1053        0.49145     0.90427


Instructor ID# 3.  Sum of Predicted Item Difficulties for this instructor = 9.6

Detailed report of sensitivity and specificity
------------------------------------------------------------------------------
                                           Correctly
Cutpoint      Sensitivity   Specificity   Classified          LR+          LR-
------------------------------------------------------------------------------
( >= 3 )          100.00%         0.00%       85.71%       1.0000     
( >= 4 )          100.00%       100.00%      100.00%                    0.0000
( >= 8 )           33.33%       100.00%       42.86%                    0.6667
( >= 9 )           16.67%       100.00%       28.57%                    0.8333
( >  9 )            0.00%       100.00%       14.29%                    1.0000
------------------------------------------------------------------------------


                      ROC      Bamber        -Asymptotic Normal--
           Obs       Area     Std. Err.      [95% Conf. Interval]
     ------------------------------------------------------------
             7     1.0000            .              .     1.00000

. 
. 
. 
. log c _all
      name:  jemlog
       log:  /Users/billy/Desktop/Articles/JEM/src/logs/JEMlogs.txt
  log type:  text
 closed on:  30 Nov 2017, 06:05:11
-----------------------------------------------------------------------------------------------------------
