------------------------------------------------------------------------------------------------------------------------------------
      name:  jemlog
       log:  /Users/billy/Desktop/Articles/JEM/src/logs/JEMlogs.txt
  log type:  text
 opened on:  30 Nov 2017, 23:13:09

. 
. import excel using ../data/raw.xlsx, clear first case(l)

. 
. qui: replace porf = cond(porf == "P", "1", cond(porf == "F", "0", ""))

. rename (inst1 studno studscor porf itemno itemjud)(inst1 stdid score pred        ///   
> itemid itemdiff)

. qui: destring pred, replace

. la def passfail 0 "Fail" 1 "Pass", modify

. la val pred passfail

. qui: g byte tchid = cond(inst1 == "A", 1, cond(inst1 == "B", 2, 3))

. drop inst1

. mata:
------------------------------------------------- mata (type end to exit) ----------------------------------------------------------
:         angoff = select(st_data(., (4..6)), rowmissing(st_data(., (4..6))) :== 0)

:         cutscores = J(1, 4, .)

:         for( i = 1; i <= 3; i++) {
>                 cutscores[1, i] = colsum(select(angoff[., 2], angoff[., 3] :== i))
>         }

:         cutscores[1, 4] = rowsum(cutscores[1, 1..3]) / 3

:         st_matrix("cutscores", cutscores)

:         // Rater 1 ratings
:         r1 = select(angoff[., (1..2)], angoff[., 3] :== 1)

:         r2 = select(angoff[., (1..2)], angoff[., 3] :== 2)

:         r3 = select(angoff[., (1..2)], angoff[., 3] :== 3)

:         mu1 = mean(r1[., 2])

:         mu2 = mean(r2[., 2])

:         mu3 = mean(r3[., 2])

:         sigma1 = sqrt(variance(r1[., 2]))

:         sigma2 = sqrt(variance(r2[., 2]))

:         sigma3 = sqrt(variance(r3[., 2]))

:         items = J(3, 13, .)

:         for(i = 1; i <= 13; i++) {
>                 items[1, i] = r1[i, 2]
>                 items[2, i] = r2[i, 2]
>                 items[3, i] = r3[i, 2]
>         }

:         muitems = mean(items)

:         sigmaitems = J(1, 13, .)

:         for(i = 1; i <= 13; i++) {
>                 sigmaitems[1, i] = sqrt(variance(items[., i]))
>         }

:         itemsummary = (muitems', sigmaitems')

:         ratersummary = (mu1, sigma1 \ mu2, sigma2 \ mu3, sigma3)

:         st_matrix("items", itemsummary)

:         st_matrix("raters", ratersummary)

: end
------------------------------------------------------------------------------------------------------------------------------------

. 
. forv i = 1/13 {
  2.         loc irownames `irownames' Item`i'
  3. }

. loc colnms Mean "Std Dev"

. mat rownames items = `irownames'

. mat rownames raters = Instructor1 Instructor2 Instructor3

. mat colnames items = `colnms'

. mat colnames raters = `colnms'

. mat li items

items[13,2]
             Mean    Std Dev
 Item1         .8         .1
 Item2  .58333333  .18929694
 Item3         .6         .1
 Item4  .46666667   .2081666
 Item5  .53333333  .23094011
 Item6        .65  .25980762
 Item7        .55  .18027756
 Item8        .45  .21794495
 Item9         .5         .2
Item10  .43333333  .23094011
Item11         .5         .2
Item12  .48333333  .20207259
Item13        .45  .30413813

. mat li raters

raters[3,2]
                  Mean    Std Dev
Instructor1  .38461538   .1328919
Instructor2  .49230769   .1754116
Instructor3  .73846154  .07679476

. 
. drop itemid itemdiff

. forv i = 1/3 {
  2.         g tch`i'cutscore = cutscores[1, `i']
  3.         g tch`i'pf = score >= tch`i'cutscore
  4.         g tch`i'dist = score - tch`i'cutscore
  5. }
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)

. g angoff = cutscores[1, 4]

. g byte angoffpf = score >= angoff

. g byte angoffdist = score - angoff
(5 missing values generated)

. foreach v of var *pf {
  2.         la val `v' passfail
  3. }

. drop if mi(stdid)
(5 observations deleted)

. la var stdid "Student ID #"

. la var tchid "Instructor ID #"

. la var score "Observed Test Score"

. la var pred "Contrasting Groups Prediction"

. la var tch1cutscore "Sum of Instructor 1 Item Difficulties"

. la var tch2cutscore "Sum of Instructor 2 Item Difficulties"

. la var tch3cutscore "Sum of Instructor 3 Item Difficulties"

. la var angoff "Cutscore Derived through Angoff Method"

. 
. la var tch1pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var tch2pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var tch3pf "Pass/Fail Indicator Derived from Instructor 1 Total Difficulty"

. la var angoffpf "Pass/Fail Indicator Derived using Angoff Threshold"

. 
. la var tch1dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var tch2dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var tch3dist "Difference of Observed Student Score and Instructor 1 Total Difficulty"

. la var angoffdist "Difference of Observed Student Score and Angoff Threshold"

. 
. qui: su score if pred == 0, de

. loc fmed `r(p50)'

. 
. qui: su score if pred == 1, de

. loc pmed `r(p50)'

. 
. loc contgr `= ((`pmed' - `fmed') / 2) + `fmed''

. 
. qui: g contgr = `contgr'

. qui: g contgrpf = score >= contgr

. qui: g contgrdist = score - contgr

. 
. la val contgrpf passfail

. la var contgr "Contrasting Groups Cutscore"

. la var contgrpf "Pass/Fail Indicator Derived from Contrasting Groups Cutscore"

. la var contgrdist "Difference of Observed Student Score and Contrasting Groups Cutscore"

. 
. #d ;
delimiter now ;
. tw      hist score, discrete width(1) start(0) fc(yellow%50) lc(black) lw(vthin) ||
>         kdensity score if pred == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if pred == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         xline(`fmed', lc(black) lw(medthick) lp(dash))
>         xline(`contgr', lc(black) lw(medthick) lp(dot))
>         xline(`pmed', lc(black) lw(medthick) lp(dash))
>                 note(   "`fmed' = Predicted Failing Median - Dashed Black Line"
>                                 "`contgr' = Contrasting Groups Cutscore - Dotted Black Line"
>                                 "`pmed' = Predicted Passing Median - Dashed Black Line", c(black) size(vsmall))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Contrasting Groups Based Cutscores", c(black) size(medlarge) span)
>         name(contrastingGroup, replace);

. tw      hist score, discrete width(1) start(0) fc(yellow%50) lc(black) lw(vthin) ||
>         kdensity score if angoffpf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if angoffpf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Angoff Method Based Cutscores", c(black) size(medlarge) span)
>         name(angoff, replace);

. /*
> tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch1pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch1pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 1 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch1, replace);
> 
> tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch2pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch2pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 2 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch2, replace);
> 
> tw      hist score, discrete width(1) start(0) fc(yellow) lc(black) lw(vthin) ||
>         kdensity score if tch3pf == 0, lc(purple) lw(medthick) lp(solid) || 
>         kdensity score if tch3pf == 1, lc(orange) lw(medthick) lp(solid) 
>         legend(region(lc(white)) nobox pos(12) rows(3) cols(1) size(small)
>                 label(1 "Observed Density")
>                 label(2 "Smoothed Predicted Failure") 
>                 label(3 "Smoothed Predicted Passing")) 
>         yti("Density", size(small)) xti("Observed Student Score", size(small)) 
>         xlab(#15, labsize(small)) xsca(range(0(1)15))
>         ylab(, nogrid angle(0) labsize(small)) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) 
>         ti(     "Score Distributions Based On : " 
>                 "Sum of Instructor 3 Estimated Item Difficulties", c(black) size(medlarge) span)
>         name(tch3, replace);
>         
> gr combine tch1 tch2 tch3, name(tchcombo, replace)
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) ;
> 
> */
> 
> gr combine contrastingGroup angoff, name(methodcombo, replace) 
>         graphr(ic(white) lc(white) fc(white)) 
>         plotr(ic(white) lc(white) fc(white)) ;

.         #d cr   
delimiter now cr
. 
. foreach v in contrastingGroup angoff methodcombo {
  2.         qui: gr export graphs/`v'.pdf, as(pdf) name(`v') replace
  3. }

. 
. estout m(raters) using results/tables.rtf, mlabels(, none)                                       ///   
> ti("Table 1. Average and Standard Deviation of Raters' Ratings") replace
(note: file results/tables.rtf not found)
(output written to results/tables.rtf)

. 
. estout m(items) using results/tables.rtf, mlabels(, none)                                        ///   
> ti("Table 2. Average and Standard Deviation of Item Ratings") append
(output written to results/tables.rtf)

. 
. di _n "Score Summary Statistics"

Score Summary Statistics

. estpost tabstat score, by(tchid) c(v) s(n mean sd min p25 p50 p75 max)

Summary statistics: count mean sd min p25 p50 p75 max
     for variables: score
  by categories of: tchid

       tchid |  e(score) 
-------------+-----------
1            |           
       count |        17 
        mean |  5.411765 
          sd |  1.502449 
         min |         3 
         p25 |         4 
         p50 |         5 
         p75 |         6 
         max |         8 
-------------+-----------
2            |           
       count |        29 
        mean |  6.172414 
          sd |  2.916321 
         min |         2 
         p25 |         4 
         p50 |         6 
         p75 |         8 
         max |        13 
-------------+-----------
3            |           
       count |         8 
        mean |       5.5 
          sd |  2.390457 
         min |         3 
         p25 |         4 
         p50 |         4 
         p75 |         8 
         max |         9 
-------------+-----------
Total        |           
       count |        54 
        mean |  5.833333 
          sd |  2.462933 
         min |         2 
         p25 |         4 
         p50 |         5 
         p75 |         8 
         max |        13 

. 
. esttab ., main(score) unstack wide mlabels("Instructors", noti) nonum            ///   
> ren(count "# of Students" mean "Average Score" sd "Standard Deviation"           ///   
> min Minimum p25 "25th %ile" p50 Median p75 "75th %ile" max Maximum) noobs        ///   
> ti("Table 3.  Summary of Observed Scores Within and Between Instructors") nonote

Table 3.  Summary of Observed Scores Within and Between Instructors
--------------------------------------------------------------------------------------------------------------------------------
              Instructors                                                                                                       
                        1                            2                            3                        Total                
--------------------------------------------------------------------------------------------------------------------------------
# of Stude~s           17                           29                            8                           54                
Average Sc~e        5.412                        6.172                        5.500                        5.833                
Standard D~n        1.502                        2.916                        2.390                        2.463                
Minimum                 3                            2                            3                            2                
25th %ile               4                            4                            4                            4                
Median                  5                            6                            4                            5                
75th %ile               6                            8                            8                            8                
Maximum                 8                           13                            9                           13                
--------------------------------------------------------------------------------------------------------------------------------

. 
. di _n "Within Instructor Comparison of Angoff and Contrasting Groups Classifications"

Within Instructor Comparison of Angoff and Contrasting Groups Classifications

. 
. forv i = 1/3 {
  2.         ta contgrpf angoffpf if tchid == `i', exact
  3. }

 Pass/Fail |
 Indicator |
   Derived |
      from |  Pass/Fail Indicator
Contrastin | Derived using Angoff
  g Groups |       Threshold
  Cutscore |      Fail       Pass |     Total
-----------+----------------------+----------
      Fail |         9          0 |         9 
      Pass |         4          4 |         8 
-----------+----------------------+----------
     Total |        13          4 |        17 

           Fisher's exact =                 0.029
   1-sided Fisher's exact =                 0.029

 Pass/Fail |
 Indicator |
   Derived |
      from |  Pass/Fail Indicator
Contrastin | Derived using Angoff
  g Groups |       Threshold
  Cutscore |      Fail       Pass |     Total
-----------+----------------------+----------
      Fail |        14          0 |        14 
      Pass |         2         13 |        15 
-----------+----------------------+----------
     Total |        16         13 |        29 

           Fisher's exact =                 0.000
   1-sided Fisher's exact =                 0.000

 Pass/Fail |
 Indicator |
   Derived |
      from |  Pass/Fail Indicator
Contrastin | Derived using Angoff
  g Groups |       Threshold
  Cutscore |      Fail       Pass |     Total
-----------+----------------------+----------
      Fail |         5          0 |         5 
      Pass |         0          3 |         3 
-----------+----------------------+----------
     Total |         5          3 |         8 

           Fisher's exact =                 0.018
   1-sided Fisher's exact =                 0.018

. 
. di _n "Between Instructor Comparison of Angoff and Contrasting Groups Classifications"

Between Instructor Comparison of Angoff and Contrasting Groups Classifications

. ta contgrpf angoffpf, exact     

 Pass/Fail |
 Indicator |
   Derived |
      from |  Pass/Fail Indicator
Contrastin | Derived using Angoff
  g Groups |       Threshold
  Cutscore |      Fail       Pass |     Total
-----------+----------------------+----------
      Fail |        28          0 |        28 
      Pass |         6         20 |        26 
-----------+----------------------+----------
     Total |        34         20 |        54 

           Fisher's exact =                 0.000
   1-sided Fisher's exact =                 0.000

. 
. di _n "Correlation of Contrasting Groups and Angoff Cut Scores and Predicted Pass/Fail"

Correlation of Contrasting Groups and Angoff Cut Scores and Predicted Pass/Fail

. tetrachoric angoffpf contgrpf pred, posdef 
(obs=53)

matrix with tetrachoric correlations is not positive semidefinite;
  it has 1 negative eigenvalue
  maxdiff(corr,adj-corr) =  0.0252
  (adj-corr: tetrachoric correlations adjusted to be positive semidefinite)

    adj-corr | angoffpf contgrpf     pred
-------------+---------------------------
    angoffpf |   1.0000 
    contgrpf |   0.9748   1.0000 
        pred |   0.6374   0.4497   1.0000 

. 
. logit pred score

Iteration 0:   log likelihood = -36.273183  
Iteration 1:   log likelihood = -33.144232  
Iteration 2:   log likelihood = -33.125639  
Iteration 3:   log likelihood = -33.125632  
Iteration 4:   log likelihood = -33.125632  

Logistic regression                             Number of obs     =         53
                                                LR chi2(1)        =       6.30
                                                Prob > chi2       =     0.0121
Log likelihood = -33.125632                     Pseudo R2         =     0.0868

------------------------------------------------------------------------------
        pred |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       score |    .319296    .139803     2.28   0.022     .0452871    .5933049
       _cons |  -1.529436   .8158259    -1.87   0.061    -3.128426    .0695532
------------------------------------------------------------------------------

. esttab . using results/tables.rtf, label cells("b(star) se(par)") nonum          ///   
> ti("Table .  Logistic Regression of Predicted Pass/Fail on Observed Test Scores") ///   
> append
(output written to results/tables.rtf)

. 
. margins, at(score=(0(1)15)) post

Adjusted predictions                            Number of obs     =         53
Model VCE    : OIM

Expression   : Pr(pred), predict()

1._at        : score           =           0

2._at        : score           =           1

3._at        : score           =           2

4._at        : score           =           3

5._at        : score           =           4

6._at        : score           =           5

7._at        : score           =           6

8._at        : score           =           7

9._at        : score           =           8

10._at       : score           =           9

11._at       : score           =          10

12._at       : score           =          11

13._at       : score           =          12

14._at       : score           =          13

15._at       : score           =          14

16._at       : score           =          15

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .1780762   .1194084     1.49   0.136      -.05596    .4121124
          2  |   .2296762   .1215952     1.89   0.059     -.008646    .4679985
          3  |   .2909356   .1163672     2.50   0.012     .0628602    .5190111
          4  |   .3608796   .1039553     3.47   0.001     .1571309    .5646284
          5  |   .4372692   .0877526     4.98   0.000     .2652772    .6092612
          6  |   .5167546   .0750436     6.89   0.000     .3696719    .6638373
          7  |   .5954012   .0732758     8.13   0.000     .4517832    .7390192
          8  |    .669436   .0809545     8.27   0.000     .5107681     .828104
          9  |   .7359321   .0899475     8.18   0.000     .5596382     .912226
         10  |   .7931843    .094764     8.37   0.000     .6074503    .9789182
         11  |   .8407104     .09396     8.95   0.000     .6565522    1.024869
         12  |   .8789814   .0883571     9.95   0.000     .7058047    1.052158
         13  |   .9090521    .079589    11.42   0.000     .7530606    1.065044
         14  |   .9322269   .0692837    13.46   0.000     .7964335     1.06802
         15  |   .9498224   .0587103    16.18   0.000     .8347523    1.064893
         16  |   .9630309   .0487052    19.77   0.000     .8675705    1.058491
------------------------------------------------------------------------------

. 
. esttab . using results/tables.rtf, cells(b(star) se(par)) rename(1._at 1 2._at 2 3._at 3 4._at 4 5._at 5 6._at 6 7._at 7 8._at 8 9
> ._at 9 10._at 10 11._at 11 12._at 12 13._at 13 14._at 14 15._at 15 16._at 16) nonum mti("Marginal Effects") collabel(, none) noobs
>  note("Standard Errors in Parentheses") ti("Table .  Predicted Probabilities by Observed Score")
file results/tables.rtf already exists
r(602);

end of do-file

r(602);

. do "/var/folders/px/cg4_66j52pvfn2z7pbjvb5d80000gn/T//SD01075.000000"

. esttab . using results/tables.rtf, cells(b(star) se(par)) rename(1._at 1 2._at 2 3._at 3 4._at 4 5._at 5 6._at 6 7._at 7 8._at 8 9
> ._at 9 10._at 10 11._at 11 12._at 12 13._at 13 14._at 14 15._at 15 16._at 16) nonum mti("Marginal Effects") collabel(, none) noobs
>  note("Standard Errors in Parentheses") ti("Table .  Predicted Probabilities by Observed Score") append
(output written to results/tables.rtf)

. 
. marginsplot, recastci(rarea) ylab(0(0.1)1, angle(0) nogrid) yti("Pr(Pass)", c(black) size(small)) graphr(ic(white) fc(white) lc(wh
> ite)) plotr(ic(white) fc(white) lc(white)) ciopts(lc(black) lw(vthin) fc(yellow%50)) plotop(mc(purple) mlw(vvthin) mlc(black) lc(p
> urple) lw(medium)) ti("Instructor Predicted Passing vs" "Observed Test Score", c(black) size(medlarge) span) name(margplot, replac
> e)

  Variables that uniquely identify margins: score

. 
. gr export graphs/logisticMarginalEffects.pdf, as(pdf) name(margplot) replace
(file /Users/billy/Desktop/Articles/JEM/src/graphs/logisticMarginalEffects.pdf written in PDF format)

. 
. log c _all
      name:  jemlog
       log:  /Users/billy/Desktop/Articles/JEM/src/logs/JEMlogs.txt
  log type:  text
 closed on:  30 Nov 2017, 23:13:53
------------------------------------------------------------------------------------------------------------------------------------
